### **1. 시리즈와 데이터프레임 생성**

In [1]:
#코드 2-12
import pandas as pd

a = pd.Series([1, 2, 3, 4])
print(a)
b = pd.Series([1, 2, 3], index=['a', 'b', 'c'])
print(b)

0    1
1    2
2    3
3    4
dtype: int64
a    1
b    2
c    3
dtype: int64

In [2]:
#코드 2-13
list1 = list([['한빛', '남자', '20', '180'],
              ['한결', '남자', '21', '177'],
              ['한라', '여자', '20', '160']])
col_names = ['이름', '성별', '나이', '키']
pd.DataFrame(list1, columns=col_names)

   이름  성별  나이    키
0  한빛  남자  20  180
1  한결  남자  21  177
2  한라  여자  20  160

In [3]:
#코드 2-14
dict1 = {'이름':{0:'한빛', 1:'한결', 2:'한라'},
         '성별':{0:'남자', 1:'남자', 2:'여자'},
         '나이':{0:'20', 1:'21', 2:'20'},
         '키':{0:'180', 1:'177', 2:'160'}}
pd.DataFrame(dict1)

   이름  성별  나이    키
0  한빛  남자  20  180
1  한결  남자  21  177
2  한라  여자  20  160

In [4]:
#코드 2-15
import numpy as np

#배열
arr1 = np.array([['한빛','남자', '20', '180'],
                 ['한결','남자', '21', '177'],
                 ['한라','여자', '20', '160']])

#열 이름 리스트
col_names = ['이름','성별','나이','키']

#데이터프레임 생성하기
pd.DataFrame(arr1, columns=col_names)

   이름  성별  나이    키
0  한빛  남자  20  180
1  한결  남자  21  177
2  한라  여자  20  160

In [5]:
#코드 2-16
list1 = list([['허준호','남자','30','183'],
              ['이가원','여자','24','162'],
              ['배규민','남자','23','179'],
              ['고고림','남자','21','182'],
              ['이새봄','여자','28','160'],
              ['이보람','여자','26','163'],
              ['이루리','여자','24','157'],
              ['오다현','여자','24','172']])
col_names = ['이름','성별','나이','키']
df = pd.DataFrame(list1, columns=col_names)
df

    이름  성별  나이    키
0  허준호  남자  30  183
1  이가원  여자  24  162
2  배규민  남자  23  179
3  고고림  남자  21  182
4  이새봄  여자  28  160
5  이보람  여자  26  163
6  이루리  여자  24  157
7  오다현  여자  24  172

In [6]:
#코드 2-17
#디렉토리에 CSV 파일로 저장하기
df.to_csv('./file.csv', header=True, index=False, encoding='utf-8')
#CSV 파일 읽기
df2 = pd.read_csv('./file.csv', sep=',')

df2

    이름  성별  나이    키
0  허준호  남자  30  183
1  이가원  여자  24  162
2  배규민  남자  23  179
3  고고림  남자  21  182
4  이새봄  여자  28  160
5  이보람  여자  26  163
6  이루리  여자  24  157
7  오다현  여자  24  172

In [7]:
#코드 2-18
df.columns

Index(['이름', '성별', '나이', '키'], dtype='object')

In [8]:
#코드 2-19
df.describe()

         이름  성별  나이    키
count     8   8   8    8
unique    8   2   6    8
top     허준호  여자  24  183
freq      1   5   3    1

In [9]:
#코드 2-20
df.head(3)

    이름  성별  나이    키
0  허준호  남자  30  183
1  이가원  여자  24  162
2  배규민  남자  23  179

In [10]:
#코드 2-21
df.tail()

    이름  성별  나이    키
3  고고림  남자  21  182
4  이새봄  여자  28  160
5  이보람  여자  26  163
6  이루리  여자  24  157
7  오다현  여자  24  172

### **2. 데이터프레임 데이터 분석**

In [ ]:
#코드 2-22
df.sort_index(axis=0).head()

In [ ]:
#코드 2-23
#나이 열과 키 열을 기준으로 행을 정렬하기
df.sort_values(by=['나이', '키'], ascending=False).head()

In [ ]:
#코드 2-24
df[['이름', '키']].head()

In [ ]:
#코드 2-25
df.iloc[1:4, 0:3]

In [ ]:
#코드 2-26
df[df['키'] > 180]

In [ ]:
#코드 2-27
list1 = list([['허준호', '남자', 30, 183],
              ['이가원', '여자', 24, 162],
              ['배규민', '남자', 23, 179],
              ['고고림', '남자', 21, 182],
              ['이새봄', '여자', 28, 160],
              ['이보람', '여자', 26, 163],
              ['이루리', '여자', 24, 157],
              ['오다현', '여자', 24, 172]])
col_names = ['이름', '성별', '나이', '키']
df = pd.DataFrame(list1, columns=col_names)

df[df['키'] > 180]

In [ ]:
코드 2-28
df[df['나이'].isin([21, 23])]

In [ ]:
#코드 2-29
df[(df['성별'] == '여자') & (df['키'] > 160)]

In [ ]:
#코드 2-30
df[(df['나이'] >= 28) | (df['성별'] == '남자')]

In [ ]:
#코드 2-31
df[df['이름'].str.contains('봄')]

In [ ]:
#코드 2-32
df.describe()

In [ ]:
#코드 2-33
df.loc[4,'키'] = df.loc[4,'키'] + 5
df.loc[[4]]

In [ ]:
#코드 2-34
df.loc[1:3,'키'] = ['모름'] * 3
df

In [ ]:
#코드 2-35
df.set_index('이름', inplace=True)
df.head(3)

In [ ]:
#코드 2-36
df['보너스'] = df['나이'] * 10000
df.head(3)

In [ ]:
#코드 2-37
df.drop('보너스', axis=1, inplace=True)
df.head(3)

In [ ]:
#코드 2-38
df.reset_index(inplace=True)
df.head(3)

In [ ]:
#코드 2-39
rep_cond = {'성별':{'남자':1, '여자':0}}
df2 = df.replace(rep_cond)
df2.head(3)

In [ ]:
#코드 2-40
#성별 평균 키
mean_by_gender = df.groupby(by=['성별'], as_index=False)['키'].mean()
mean_by_gender.rename(columns={'키':'평균 키'}, inplace=True)
#성별 키의 표준편차
std_by_gender = df.groupby(by=['성별'], as_index=False)['키'].std()
std_by_gender.rename(columns = {'키':'키의 표준편차'}, inplace=True)

new_df = pd.merge(mean_by_gender, std_by_gender)
new_df